# 字典键值对的增、删、改

students_info = {
    2024999001:{
        '姓名':'Emily',
        '成绩':{
            '微积分':84,
            '大雾':77,
            '小雾':71
        }
    },
    2024999002:{
        '姓名':'Jacob',
        '成绩':{
            '微积分':92,
            '大雾':77,
            '小雾':78
        }
    }
}

print('学号2024999002的同学的姓名是', students_info[2024999002]['姓名'])
print('这位同学的微积分成绩是', students_info[2024999002]['成绩']['微积分'])

students_info[2024999002]['成绩']['微积分'] = 95
print('这位同学修改后的微积分成绩是', students_info[2024999002]['成绩']['微积分'])

students_info[2024666666] = {
    '姓名':'You know who',
    '成绩':{'微积分':66,'大雾':66,'小雾':66}
}

print('增加2024666666的信息后，字典为：')
print(students_info)

del students_info[2024999002]
print('删除2024999002的信息后，字典为：')
print(students_info)
